---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsCurveDiameterParam
source: html/5c30ebed-0bf6-ec46-a932-054f57db2df2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsCurveDiameterParam Property

"Diameter"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsCurveDiameterParam { get; }
```